<font color='green'>

## 11. Gruplama İşlemleri

### Gruplama işlemi veri setinde yer alan kategorik değişkenlerinin gruplarının yakalanması ve bu grupların üzerinde bir takım işlemler yapılması demektir.

In [2]:
import pandas as pd

In [3]:
dataf=pd.DataFrame({'gruplar' : ['A','B','C','A','B','C'],
		'veri' : [10,11,52,23,43,55]}, columns=['gruplar','veri'])
dataf

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [4]:
dataf.groupby("gruplar")

### Burada yaptığımız işlemin türkçesi :
### Dataframe'e git 'groupby()' fonksiyonu ile gruplar değişkenini yakala bu gruplar değişkeninin içerisinde yer alan kategori sınıflarını tut(A,B,C)
### Ayrıca tek başına çalışamayacağı ve aggregetion fonksiyonu gerektiği için birşey yapmadan arka planda nesne oluşturdu.

### Yakalamış olduğu A,B,C gruplarının ortalamasını bulalım.

In [5]:
dataf.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

### Yakalamış olduğu A,B,C gruplarının kendi içindeki toplamını bulalım.

In [6]:
dataf.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

### Daha büyük bir veri seti ele alalım.

In [7]:
import seaborn as sns

In [8]:
dataf=sns.load_dataset("planets")

### Hali hazırda bulunan planets veri setini çektik ve bir değişkene atadık. Bu yeni veri setimize kısaca bir göz atalım.

In [9]:
dataf.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Örneğin bu veri setindeki 'method' değişkenini bir yakalayalım :

In [10]:
dataf.groupby("method")

> **method değişkeni yakalandı. Görev bekliyor.**

In [12]:
dataf.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

### method' değişkeninin içerisindeki sınıfları groupby() ile yakaladı. Bu gruplara karşılık gelen 'orbital_period' değişkenini yakaladı. Sonrasında bu değişkenin ortalama değerini hesaplattık.

### Her aggregation fonksiyonu için çalıştırabiliriz.

### [12. İleri Toplulaştırma İşlemleri 'Aggregate,filter,transform,apply' notlarına geçmek için tıklayınız.](https://github.com/semihstp/Veri-Bilimi-Not-Defterim/blob/master/Pandas%20K%C3%BCt%C3%BCphanesi/12.%20%C4%B0leri%20Toplula%C5%9Ft%C4%B1rma%20%C4%B0%C5%9Flemleri%20'Aggregate%2Cfilter%2Ctransform%2Capply'.ipynb)